
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработчикКнопкиВыполнить(Команда)
	
	ОчиститьСообщения();
	ВыбранныйАлгоритм = Элементы.СписокАлгоритмов.ТекущаяСтраница.Имя;
	ОбщегоНазначения.ВыполнитьВБезопасномРежиме(ВыбранныйАлгоритм + "()");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-check module-unused-method
&НаКлиенте
Процедура АлгоритмСообщение()
	
	НазваниеСклада 	= "Основной";
	Количество 		= 125;
	ДатаПодсчета 	= '2022-04-01 10:00:00';
	ШаблонВвода 	= НСтр("ru = 'На дату %1 остаток металла на складе "" %2 "" : %3 шт.'");
	ТекстВвода 		= СтрШаблон(ШаблонВвода, ДатаПодсчета, НазваниеСклада, Количество);
	
	ОбщегоНазначения.СообщениеПользователю(ТекстВвода);
	//Сообщить(ТекстВвода);
	
КонецПроцедуры  

//@skip-check module-unused-method
&НаКлиенте 
Процедура АлгоритмРасчет()
	
	Себестоимость 	= 100;
	Наценка 		= 40;
	СтавкаНДС 		= 20;
	Наценка 		= Себестоимость * Наценка/100;
	ЦенаСНаценкой 	= Себестоимость + Наценка;
	НДС 			= ЦенаСНаценкой * СтавкаНДС/100;
	ИтоговаяЦена 	= ЦенаСНаценкой + НДС;
	ШаблонВвода		= НСтр("ru = 'Итоговая цена: %1'");
	ТекстРасчета 	= СтрШаблон(ШаблонВвода, ИтоговаяЦена);
	
	ОбщегоНазначения.СообщениеПользователю(ТекстРасчета);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура АлгоритмВозрастВНеделях()
	
	ДатаРождения	= '2024-01-01';
	ТекущаяДата		= 	Дата('2024-03-25');  
	РазницаВДнях	= ТекущаяДата - ДатаРождения; 	
	ВозрастВНеделях	= РазницаВДнях / 604800; 		//7 ДнейВНеделе * 24 Часав1Дне * 60 МинутВ1часе * 60 СекундВ1Минуте = 604800
	ШаблонВвода = НСтр("ru = 'Возраст в неделях: %1'");
	ТекстВозрастВНеделях = СтрШаблон(ШаблонВвода, ВозрастВНеделях);
	
	ОбщегоНазначения.СообщениеПользователю(ТекстВозрастВНеделях);
	
КонецПроцедуры
 
//@skip-check module-unused-method
&НаКлиенте
Процедура АлгоритмФамилияИмяОтчество()
		
	ФИО 			= "Иванов Иван Иванович";
	Имя 			= Сред(ФИО, 8); 
	Отчество		= Сред(ФИО, 13); 
	СокращенноеФИО 	= Лев(ФИО, СтрНайти(ФИО, " ") - 1) + " " + Лев(Имя, 1) + "." + Лев(Отчество, 1) + ".";  
	ШаблонВвода 	= НСтр("ru = '%1 = %2'");
	ТекстФИО 		= СтрШаблон(ШаблонВвода,ФИО, СокращенноеФИО);
	
	ОбщегоНазначения.СообщениеПользователю(ТекстФИО);
		
КонецПроцедуры  

#КонецОбласти
	
	
	
	